{"data":{"site":{"siteMetadata":{"title":"Blogging!","author":"Agustín Aliaga"}},"markdownRemark":{"id":"d93fb2b6-5c3b-50d2-bbfa-0f480b402548","excerpt":"In my work experience, one basic thing I learned about software engineering is that you don’t need to “reinvent the wheel” every time you…","html":"<p>\n  <a\n    class=\"gatsby-resp-image-link\"\n    href=\"/static/dependencies-05fc6a58a8028a65c5d7f65a821b7234-f73e5.jpg\"\n    style=\"display: block\"\n    target=\"_blank\"\n    rel=\"noopener\"\n  >\n  \n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; ; max-width: 590px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 70.34965034965035%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAAOABQDASIAAhEBAxEB/8QAFwABAQEBAAAAAAAAAAAAAAAAAgABBP/EABYBAQEBAAAAAAAAAAAAAAAAAAABAv/aAAwDAQACEAMQAAAB7ljuFKP/xAAbEAACAgMBAAAAAAAAAAAAAAABAgADERITIv/aAAgBAQABBQKxvXWCxY1ZLawDA//EABURAQEAAAAAAAAAAAAAAAAAAAAR/9oACAEDAQE/AYj/xAAVEQEBAAAAAAAAAAAAAAAAAAAAEf/aAAgBAgEBPwFX/8QAGhAAAgIDAAAAAAAAAAAAAAAAABEBMQIQgf/aAAgBAQAGPwKFkipLIS6Xr//EABwQAQACAgMBAAAAAAAAAAAAAAEAETFBYXGR0f/aAAgBAQABPyFW2ZfTAqe0QfUbMCxfGnG49DU//9oADAMBAAIAAwAAABBzD//EABQRAQAAAAAAAAAAAAAAAAAAABD/2gAIAQMBAT8QD//EABYRAQEBAAAAAAAAAAAAAAAAAAARAf/aAAgBAgEBPxC6p//EABwQAQEAAgIDAAAAAAAAAAAAAAERADFBYSGB4f/aAAgBAQABPxCJGSBVJs55whQWCEldeF51jaRGNpxWJYtKjPvrJghBYEHt1lkJ2wz/2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"dependencies\"\n        title=\"\"\n        src=\"/static/dependencies-05fc6a58a8028a65c5d7f65a821b7234-f8fb9.jpg\"\n        srcset=\"/static/dependencies-05fc6a58a8028a65c5d7f65a821b7234-e8976.jpg 148w,\n/static/dependencies-05fc6a58a8028a65c5d7f65a821b7234-63df2.jpg 295w,\n/static/dependencies-05fc6a58a8028a65c5d7f65a821b7234-f8fb9.jpg 590w,\n/static/dependencies-05fc6a58a8028a65c5d7f65a821b7234-85e3d.jpg 885w,\n/static/dependencies-05fc6a58a8028a65c5d7f65a821b7234-d1924.jpg 1180w,\n/static/dependencies-05fc6a58a8028a65c5d7f65a821b7234-f73e5.jpg 1430w\"\n        sizes=\"(max-width: 590px) 100vw, 590px\"\n      />\n    </span>\n  </span>\n  \n  </a>\n    </p>\n<p>In my work experience, one basic thing I learned about software engineering is that you don’t need to “reinvent the wheel” every time you want to achieve some functionality. Open source projects have revolutionized the way we work in that we can reutilize existing software in addition to collaborating with others devs. In the web-development ecosystem, there are plenty of frameworks and tools that already simplify things like user authentication, routes, templating (client-side and server-side), state-management, database queries, web sockets, etc. On the other hand, however, sometimes the existing solutions are just not good enough or it may be that there are no alternatives at all, but that’s a completely different story.</p>\n<p>The ability to know when to implement the feature yourself and when to use an existing solution will be a crucial asset for your team. Adopting a new library, language or technology as a dependency to build your product without extensive research could become headache in the future, so you should always ask yourself at least these questions about it:</p>\n<h4>Does it meet all your needs?</h4>\n<p>Sometimes you’ll find a solution for your problem that does not cover all the specific features you need. In that case, you might have to deal with forking and extending it (if it’s an open source project), and this means greater time investments and costs. Are your team and the client prepared for this scenario?</p>\n<h4>Is there any documentation?</h4>\n<p>If so, is it well documented? Just as an example, one of the things I like the most about Django (web framework) is the quality they put into the docs. It’s remarkably easy to find the topics you need for the framework version you’re using. <a href=\"https://docs.djangoproject.com/en/\">https://docs.djangoproject.com/en/</a>.</p>\n<h4>Is it supported by a “big” community and/or a private company? Having a company or a community behind it helps a lot when you’re having trouble and need assistance from others. You may have to send a “help-desk” ticket (probably if it’s a paid service), find information on blogs or StackOverflow, or maybe even post a question to those sites. If you’re relying on the community to help you, your chances of being helped are proportional to the popularity of the software dependency.</h4>\n<h4>Is it an “external service”?</h4>\n<p>If you rely on services like “Google Maps API”, “Facebook Graph API”, “Google’s Firebase”, etc. be aware that they may change in the future without notice, or they could just stop working at any time (temporarily or permanently). SaaS/BaaS solutions are great but you should think twice before setting them up as a critical piece of your system. Just as an example, read about what happened to Facebook’s Parse: (<a href=\"https://techcrunch.com/2016/01/28/facebook-shutters-its-parse-developer-platform/\">https://techcrunch.com/2016/01/28/facebook-shutters-its-parse-developer-platform/</a>).</p>\n<h4>Is it actively maintained and improved?</h4>\n<p>If hosted on Github, “Pulse” and “Graphs” tabs will give you an idea of the latest activity. You probably don’t want to set up an outdated library, because it could bring retrocompatibility issues to your project. Also, if it’s constantly evolving, sometimes it could mean you’ll have to update your code repeatedly.</p>\n<h4>Is it tested?</h4>\n<p>Some libraries use automated tools to build and test every change that is introduced (applying continuous integration tools like Travis CI, Circle CI, etc.). This makes the library more reliable.</p>\n<h4>Are you compromising another dependency if you adopt this new library?</h4>\n<p>Sometimes libraries don’t play well together.</p>\n<h4>Will it affect your product’s performance, speed, size, etc.?</h4>\n<p>You should always take this into consideration. In the “web environment”, a giant front-end library could affect the browser’s performance and also increase network transfer times. On the back-end side, you want to avoid server overloading. In the mobile world, things get even more critical because mobile phones don’t have as many resources as a desktop computer. In Android, an app that wastes memory and CPU is a real candidate to be killed automatically by the operating system.</p>\n<h2>Finishing!</h2>\n<p>Every product relies on dependencies (whether it’s an OS, a service, a framework, a library or some other kind of software). The goal is to pick the best ones to maximize your productivity, without affecting your product’s performance, scalability, and capacity to evolve over time.</p>","frontmatter":{"title":"Things to keep in mind before adding another software dependency to your project","date":"January 20, 2017"}}},"pageContext":{"slug":"/things-to-keep-in-mind-before-adding-dependencies/","previous":null,"next":{"fields":{"slug":"/common-android-scenarios-with-and-without-dependencies-part-1-rest/"},"frontmatter":{"title":"Common Android scenarios with and without third-party dependencies, part 1: REST Client"}}}}